/* 모스부호(1)
  문제 설명: 머쓱이는 친구에게 모스부호를 이용한 편지를 받았습니다. 
          그냥은 읽을 수 없어 이를 해독하는 프로그램을 만들려고 합니다. 
          문자열 letter가 매개변수로 주어질 때, letter를 영어 소문자로 바꾼 문자열을 return 하도록 solution 함수를 완성해보세요.
          모스부호는 다음과 같습니다.
          morse = { 
              '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
              '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
              '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
              '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
              '-.--':'y','--..':'z'
          }
*/
function solution(letter) {
  morses = {
    ".-": "a",
    "-...": "b",
    "-.-.": "c",
    "-..": "d",
    ".": "e",
    "..-.": "f",
    "--.": "g",
    "....": "h",
    "..": "i",
    ".---": "j",
    "-.-": "k",
    ".-..": "l",
    "--": "m",
    "-.": "n",
    "---": "o",
    ".--.": "p",
    "--.-": "q",
    ".-.": "r",
    "...": "s",
    "-": "t",
    "..-": "u",
    "...-": "v",
    ".--": "w",
    "-..-": "x",
    "-.--": "y",
    "--..": "z",
  };
  morse = Object.keys(morses);
  var answer = "";
  letter = letter.split(" ");
  letter.map((x) => {
    if (morse.includes(x)) answer += morses[x];
  });
  return answer;
}

console.log(solution(".... . .-.. .-.. ---"));

/**
 * Object(객체)에서 key값만 빼기
 * -> Object.keys(객체명);
 * Object(객체)에서 value값만 빼기
 * -> Object.values(객체명);
 */
